ucm/backend/app/Controllers/ClubController.php

SELECT *
FROM `clubs`
---
    public function allclubs()
    {
        $clubModel = new ClubModel();
        $clubs = $clubModel->findAll();