ucm/backend/app/Controllers/ClubController.php

SELECT *
FROM `clubs`
WHERE `clubs`.`id` = '1'
---
    public function getClub($id){
        $clubModel = new ClubModel();
        $club = $clubModel->find($id);

SELECT *
FROM `clubs`
WHERE `slug` = 'photography-and-film-club'
 LIMIT 1
SELECT *
FROM `user`
WHERE `user`.`id` = '17'
SELECT *
FROM `event`
WHERE `id_club` = '5'
---
    public function getClubBySlug($slug)
    {
        $clubModel = new ClubModel();
        $clubMembershipModel = new ClubMembershipModel();
        $club = $clubModel->where('slug', $slug)->first();

        if ($club) {
            $userModel = new UserModel();
            $user = $userModel->find($club['id_president']);

            $eventModel = new EventModel();
            $events = $eventModel->where('id_club', $club['id'])->findAll();

SELECT COUNT(*) AS `numrows`
FROM `clubmembership`
WHERE `id_club` = '1'
---
    public function clubstatistics($id)
    {
        $userModel = new UserModel();
        $eventModel = new EventModel();
        $clubMembershipModel = new ClubMembershipModel();


        $clubModel = new ClubModel();
        $club = $clubModel->find($id);
        if (!$club) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Club not found'], 404);
        }


        $totalUsers = $clubMembershipModel->where('id_club', $id)->countAllResults();