ucm/backend/app/Controllers/EventController.php

    public function allEvents()
    {
        $eventModel = new EventModel();
        $events = $eventModel->findAll();
---
SELECT *
FROM `event`

    public function getClubEvents($id)
    {
        $clubModel = new ClubModel();
        $eventModel = new EventModel();

        // Check if the club exists
        $club = $clubModel->find($id);
        if (!$club) {
            log_message('error', 'Club not found: ' . $id);
            return $this->response->setJSON(['status' => 'error', 'message' => 'Club not found'], 404);
        }

        // Fetch events for the club
        $events = $eventModel->where('id_club', $id)->findAll();
---
SELECT *
FROM `clubs`
WHERE `clubs`.`id` = '5'
SELECT *
FROM `event`
WHERE `id_club` = '5'