ucm/backend/app/Controllers/EventController.php

    public function getEventParticipants($id)
    {
        $eventModel = new EventModel();
        $eventRequestModel = new EventRequestModel();

        // Check if the event exists
        $event = $eventModel->find($id);

        if (!$event) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Event not found'
            ], 404);
        }

        // Get participants with 'approved' status
        $participants = $eventRequestModel
            ->select("
                eventrequest.id as requestId,
                eventrequest.type,
                eventrequest.status,
                eventrequest.request_date,
                CASE
                    WHEN eventrequest.type = 'user' THEN CONCAT(user.first_name, ' ', user.last_name)
                    ELSE visitors.name
                END AS name,
                CASE
                    WHEN eventrequest.type = 'user' THEN user.email
                    ELSE visitors.email
                END AS email
            ")
            ->join('user', 'eventrequest.id_visitor = user.id AND eventrequest.type = "user"', 'left')
            ->join('visitors', 'eventrequest.id_visitor = visitors.id AND eventrequest.type = "visitor"', 'left')
            ->where('eventrequest.id_event', $id)
            ->findAll();
---
SELECT *
FROM `event`
WHERE `event`.`id` = '1'
SELECT `eventrequest`.`id` as `requestId`, `eventrequest`.`type`, `eventrequest`.`status`, `eventrequest`.`request_date`, CASE
                    WHEN eventrequest.type = 'user' THEN CONCAT(user.first_name, ' ', user.last_name)
                    ELSE visitors.name
                END AS name, CASE
                    WHEN eventrequest.type = 'user' THEN user.email
                    ELSE visitors.email
                END AS email
FROM `eventrequest`
LEFT JOIN `user` ON `eventrequest`.`id_visitor` = `user`.`id` AND `eventrequest`.`type` = "user"
LEFT JOIN `visitors` ON `eventrequest`.`id_visitor` = `visitors`.`id` AND `eventrequest`.`type` = "visitor"
WHERE `eventrequest`.`id_event` = '1'