ucm/backend/app/Controllers/UserController.php

    public function updateUser($id)
    {
        $validation = \Config\Services::validation();

        // Define validation rules (all fields optional but validated if provided)
        $validation->setRules([
            'email' => 'permit_empty|valid_email|max_length[255]',
            'first_name' => 'permit_empty|string|max_length[255]',
            'last_name' => 'permit_empty|string|max_length[255]',
            'password' => 'permit_empty|min_length[8]',
            'picture' => 'permit_empty|uploaded[picture]|max_size[picture,1024]|ext_in[picture,png,jpg,jpeg,avif,webp]',
            'cin' => 'permit_empty|string|min_length[2]',
        ]);

        // Validate the incoming data
        if (!$validation->withRequest($this->request)->run()) {
            return $this->response->setJSON(['status' => 'error', 'message' => $validation->getErrors()]);
        }

        $userModel = new UserModel();

        // Check if the user exists
        $user = $userModel->find($id);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '15'

        }

        // Update user
        if (!empty($data) && $userModel->update($id, $data)) {
---
UPDATE `user` SET `password` = '$2y$10$aJXHRHvPzeMekibaxkcIx.Jzde7ivIXp/HiyyPYjTWiGB8HvcYZD2'
WHERE `user`.`id` IN ('15')

    public function allusers(){
        $userModel = new UserModel();
        $users = $userModel->findAll();
---
SELECT *
FROM `user`

    public function login()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'email' => 'required|valid_email',
            'password' => 'required'
        ]);

        if (!$validation->run((array)$this->request->getJSON())) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Validation failed',
                'errors' => $validation->getErrors()
            ]);
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $this->request->getJSON()->email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'alahyane900@gmail.com'
 LIMIT 1

    public function getuserByid($id)
    {
        $userModel = new UserModel();
        $clubMembershipModel = new ClubMembershipModel();



        $user = $userModel->find($id);
        if (!$user) {

            return $this->response->setJSON(['status' => 'error', 'message' => 'User not found'], 404);
        }


        $memberships = $clubMembershipModel->where('id_user', $id)->findAll();
---
SELECT *
FROM `user`
WHERE `user`.`id` = '5'
SELECT *
FROM `clubmembership`
WHERE `id_user` = '5'