Dev/backend/app/Controllers/UserController.php

    public function getuserByid($id)
    {
        $userModel = new UserModel();
        $clubMembershipModel = new ClubMembershipModel();



        $user = $userModel->find($id);
        if (!$user) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'User not found'], 404);
        }


        $memberships = $clubMembershipModel->where('id_user', $id)->findAll();
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'
SELECT *
FROM `clubmembership`
WHERE `id_user` = '1'